<template>
  <div id="q-app">
    <router-view :students="students"/>
  </div>
</template>

<script>
export default {
  name: "App",
  data() {
    return {
      students: [
        {
          name: "Оксана",
          surname: "",
          imgSrc: "../statics/img/project1.jpg",
          teaser: "Оксана не только хорошо поет, но и замечательно рисует.",
          description:
            "Посещает уроки по вокалу. Оксана не только хорошо поет, но и замечательно рисует. Ее прекрасные работы уже украшают нашу уютную студию."
        },
        {
          name: "Евгений",
          surname: "Кияниченко",
          imgSrc: "../statics/img/project2.jpg",
          teaser: "Любит петь, преподает английский язык",
          description:
            "Любит петь, преподает английский (вдруг кому интересно) и просто является хорошим человеком. Очень трудолюбив и настойчив, что и помогает ему добиваться поставленных целей."
        },
        {
          name: "Ольга",
          surname: "Шухно",
          imgSrc: "../statics/img/project3.jpg",
          teaser: "Невероятно творческая личность.",
          description:
            "Невероятно творческая личность. Чувствует музыку как то по-особенному. Пробует различныевокальные техники от фолька до академического вокала, не боится экспериментировать и уже является лауреатом международных конкурсов!"
        },
        {
          name: "Зарина",
          surname: "Таипова",
          imgSrc: "../statics/img/project4.jpg",
          teaser:
            "Наша юная принцесса уже имеет богатый опыт концертных выступлений.",
          description:
            "Наша юная принцесса уже имеет богатый опыт концертных выступлений. Впереди конкурсы и фестивали."
        },
        {
          name: "Софья",
          surname: "",
          imgSrc: "../statics/img/project5.jpg",
          teaser: "Софья, юный меланхолик, певица и композитор.",
          description:
            "Софья, юный меланхолик, певица и композитор. Не устает удивлять своим стремлением освоить всевозможные музыкальные инструменты. За урок успевает и попеть, и посочинять и подыграть себе на клавишах."
        }
      ]
    };
  }
};
</script>
